import Hero from "@/components/Hero";
import About from "@/components/About";

export const metadata = {
  title: 'Аліна Дорохова | Логопед онлайн',
  description: 'Сайт логопеда Аліни Дорохової. Онлайн-консультації, корекція мовлення, розвиток мовлення у дітей.',
  keywords: 'логопед онлайн, логопед для дітей, логопед для дорослих, логопедичні заняття онлайн, логопед для дітей з аутизмом, логопед для дітей з дислексією, логопед для дітей з затримкою мовлення, логопед для дітей з фонетичними порушеннями, логопед для дітей з дизартрією, логопед для дітей з алалією, логопед для дітей з ринолалією, логопед для дітей з заїканням, логопед для дітей з дисграфією, логопед для дітей з дислексією, логопед для дітей з афазією, логопед для дітей з аграматизмом, логопед для дітей з фонематичним недорозвиненням',
  author: 'Аліна Дорохова',
  creator: 'Олександр Дорохов',
}

export default function Home() {

  return (
    <>
      <Hero />
      <About />
    </>
  );
}
