import Card from "./Card"
import styles from '../styles/Approach.module.css'

export default function Approach() {
    return (
        <div className={styles.wrap}>
            <h3 className={styles.title}>Мій підхід</h3>

            <div className={styles.cards}>
               <Card
                    src="/png/skills.png"
                    title="Адаптовані заняття"
                    text="Кожна дитина унікальна, тому під час роботи враховуються її особливості, темп розвитку та характер. Методики підбираються персонально, щоб заняття були комфортними, ефективними та цікавими"
                />

                <Card
                    src="/png/puzzle.png"
                    title="Ігрові методики"
                    text="Діти краще засвоюють матеріал у процесі гри, тому заняття включають інтерактивні вправи, картки, логопедичні ігри та навіть елементи театралізації. Це допомагає зняти напругу та зробити навчання захопливим"
                />

                <Card
                    src="/png/family.png"
                    title="Співпраця з батьками"
                    text="Для досягнення найкращих результатів важливо, щоб батьки розуміли свою відповідальність. Я пояснюю, що треба робити у повсякденному житті і даю вправи, що цьому сприятимуть"
                />
            </div>
        </div>
    )
}