import Question from "./Question"

const data = [
    {
        question: 'З дітьми якого віку ви займаєтесь?',
        answer: 'Все залежить від індивідуальних особливостей дитини. Оптимальний вік для занять онлайн – від 4 років. Також працюю з дорослими, які прагнуть покращити мовлення або вивчити українську мову.'
    },
    {
        question: 'Як проходять заняття?',
        answer: 'Заняття проходять онлайн через платформу Zoom та починаються з діагностики — аналізу мовленнєвих особливостей і складання індивідуального плану корекції. Після цього разом узгоджується зручний розклад занять. У процесі логопедичних сесій ми працюємо над правильною вимовою, виконуємо інтерактивні вправи та закріплюємо нові навички. Після кожного заняття ви отримуєте короткий звіт із рекомендаціями для самостійної роботи.'
    },
    {
        question: 'Які напрями вашої логопедичної роботи ?',
        answer: 'Проводжу онлайн-заняття для дітей та дорослих у різних напрямах. Допомагаю виправити порушення звуковимови, працюю з темпо-ритмічною стороною мовлення, зокрема з такими особливостями як заїкання, тахілалія чи клатеринг. Допомагаю у вивченні української мови як іноземної та підтримую загальний розвиток мовлення — формую правильну вимову, збагачую лексику й граматику. Проводжу корекцію інфантильного типу ковтання та навчаю читанню й письму для розвитку грамотного мовлення.'
    },
    {
        question: 'Яка вартість занять ?',
        answer: 'Вартість занять формується індивідуально й залежить від кількох факторів — типу заняття (діагностика чи корекційна сесія), тривалості (30 або 45 хвилин), а також валюти, у якій здійснюється оплата. Остаточна ціна узгоджується з урахуванням ваших потреб та запиту.'
    }
]

export default function Faq() {
    return (
        <section>
            <h1>Часті питання та відповіді</h1>
            <div className="question-list">
                {data.map((item, index) => (
                    <Question key={index} question={item.question} answer={item.answer} />
                ))}
            </div>
        </section>
    )
}