import Image from 'next/image'

export default function Intro() {
    return (
        <section>
            <h1>Про мене</h1>

            <div className='image-text'>
                <Image 
                    src='/png/alina-white-bg.png' alt='Фото на білому фоні'
                    width={500}
                    height={500}
                    />

                <p>Вітаю! Мене звати Аліна. Мій шлях почався з Донбаського державного педагогічного університету, де я здобула ступінь магістра в галузі спеціальної освіти, а також ступінь магістра в галузі філології. Протягом 8 років я працювала з дітьми з різними мовленнєвими порушеннями – від дислалії до заїкання та затримки мовленнєвого розвитку. Моя робота ґрунтується на сучасних доказових методиках корекції мовлення, які я постійно адаптую під індивідуальні потреби кожної особистості.</p>
            </div>
        </section>
    )
}