export default function MyTools() {
    return (
        <section>
            <h1>Мої інструменти</h1>

            <div className="text">
                <ul>
                    Для ефективної та комфортної роботи використовую перевірені цифрові та методичні інструменти, що допомагають зробити заняття цікавими та результативними:

                    <li>
                        Платформа для занять

                        <span>💻 Zoom – основний інструмент для проведення онлайн-занять. Завдяки функціям демонстрації екрана, інтерактивної дошки та можливості запису сесій, учні отримують максимально зручний формат навчання.</span>
                    </li>

                    <li>
                        Візуальні та інтерактивні матеріали

                        <span>📊 Презентації в PowerPoint – адаптовані навчальні матеріали з картинками, вправами та анімацією для залучення дитини в процес.</span>

                        <span>🖊 Інтерактивна дошка Zoom / Jamboard – використовується для написання, малювання та вправ у реальному часі.</span>

                        <span>📚 Інтерактивні онлайн-платформи (Wordwall, Learning Apps, Genially, Pink Cat Games та інші ) - для утримання уваги та забезпечення цікавого процесу.
                        </span>
                    </li>

                    <li>
                        Додаткові логопедичні ресурси

                        <span>📚 Логопедичні картки та артикуляційні вправи – спеціальні матеріали для розвитку мовлення.</span>

                        <span>🎲 Логопедичні ігри та тренажери – допомагають урізноманітнити заняття та зробити процес навчання цікавим для дітей.</span>

                        <span>🔊 Аудіотренування та фонетичні вправи – розвивають сприйняття звуків і правильну вимову.</span>
                    </li>

                    <li>
                        Обладнання для якісного зв’язку

                        <span>🎧 Навушники з мікрофоном – покращують якість звуку та допомагають уникнути фонового шуму.</span>

                        <span>📹 HD-Вебкамера – для візуального контакту та демонстрації артикуляційних вправ.</span>
                    </li>
                </ul>
            </div>
        </section>
    )
}