import { ReactNode } from "react"

type Blog = {
    title: string,
    slug: string,
    date: string,
    imgSrc: string,
    content: ReactNode,   
}

export const blogs: Blog[] = [
    {
        title: 'Артикуляційна гімнастика для дітей',
        slug: 'hymnastyka',
        date: '12-04-2025',
        imgSrc: '/jpg/blog-pic-1.jpg',
        content: (
            <article>
                <p>
                    Артикуляційна гімнастика — це комплекс вправ, спрямованих на зміцнення та розвиток м’язів ротової порожнини. Вона є важливим етапом у формуванні правильної вимови у дітей. Регулярні заняття допомагають покращити рухливість язика, губ та щелепи, що сприяє чіткій вимові звуків.
                </p>

                <ol>
                    Основні вправи артикуляційної гімнастики:

                    <li>
                        &quot;Посмішка&quot; — широко посміхнутися, не показуючи зубів, та утримувати кілька секунд.
                    </li>

                    <li>
                        &quot;Трубочка&quot; — витягнути губи вперед, як для вимови звуку &quot;У&quot;.
                    </li>
                        &quot;Годинник&quot; — рухати язиком з боку в бік, торкаючись куточків губ.
                    <li>
                        &quot;Грибок&quot; — притиснути язик до піднебіння та утримувати в такому положенні.
                    </li>

                    <p>
                        Заняття слід проводити перед дзеркалом, щоб дитина могла бачити свої рухи. Виконання вправ у формі гри допоможе зробити процес цікавим і ефективним.
                    </p>
                </ol>
            </article>
        )
    },
    {
        title: 'Як навчити дитину правильно вимовляти складні звуки',
        slug: 'vymova',
        date: '06-04-2025',
        imgSrc: '/jpg/blog-pic-2.jpg',
        content: (
            <article>
                <p>
                    Деякі звуки, такі як &quot;Р&quot;, &quot;Л&quot;, &quot;Ш&quot; або &quot;Ж&quot;, можуть викликати труднощі у вимові в дітей. Проблеми часто пов’язані з недостатньою рухливістю язика або неправильною артикуляцією.
                </p>

                <ul>
                    Ось кілька методів, які можуть допомогти дитині:

                    <li>
                        Ігровий підхід:  Використовуйте цікаві вправи та ігри, що залучають дитину до тренування звуків. Наприклад, &quot;Р&quot; можна тренувати, наслідуючи звук автомобільного двигуна &quot;р-р-р&quot;.
                    </li>

                    <li>
                        Спеціальні вправи:  Наприклад, для &quot;Р&quot; корисно виконувати &quot;Грибок&quot; і &quot;Барабанчик&quot; (швидке постукування язиком по піднебінню).
                    </li>
                    
                    <li>
                        Робота з логопедом:  Якщо у дитини є стійкі труднощі з вимовою певних звуків після 5 років, рекомендується консультація спеціаліста.
                    </li>

                    <p>
                        Заняття слід проводити перед дзеркалом, щоб дитина могла бачити свої рухи. Виконання вправ у формі гри допоможе зробити процес цікавим і ефективним.
                    </p>
                </ul>
            </article>
        )
    }   
]